#+title: Testing Org Publish

** KILL Proposition
CLOSED: [2025-05-06 Tue 15:12]

Here's how to convert those tuples into a dictionary of named dimensions with width/height attributes:

#+begin_src python
from collections import namedtuple

print_wh = (279.4, 431.8)
a4_wh = (210, 297)
letter_wh = (215.9, 279.4)
card_wh = (63.5, 88.9)
ideal_wh = (88.9, 127)

Dimension = namedtuple('Dimension', ['width', 'height'])
dims = {
    'print': Dimension(*print_wh),
    'a4': Dimension(*a4_wh),
    'letter': Dimension(*letter_wh),
    'card': Dimension(*card_wh),
    'ideal': Dimension(*ideal_wh)
}

a4_margins = (dims['a4'].width - 3*dims['card'].width, dims['a4'].height - 3*dims['card'].height)
# | 19.5 | 30.299999999999955 |
letter_margins = (dims['letter'].width - 3*dims['card'].width, dims['letter'].height - 3*dims['card'].height)
# | 25.400000000000006 | 12.699999999999932 |

ideal_scaling = (ideal_wh[0] / card_wh[0], ideal_wh[1] / card_wh[1])
# | 1.4000000000000001 | 1.4285714285714284 |

simple_scaling = 1.4
#+end_src

#+RESULTS:
| 25.400000000000006 | 12.699999999999932 |

#+begin_src calc
25.4 * 1.4
#+end_src

#+RESULTS:
: 35.56
**** Empirical via Margin Elimination
R + L Margins: 5mm + 9 mm
T + B Margins: 33.5 + 31.5 mm = 65mm

88.4 x 122.27

#+begin_src calc
279.4 - 14
265.4 / 3
#+end_src

#+RESULTS:
: 88.4666666667


#+begin_src calc
431.8 - 65
366.8 / 3
#+end_src

#+RESULTS:
: 122.266666667

